const userLang = navigator.language || navigator.userLanguage; 
const langCode = userLang.substr(0, 2);
const i18nMapping = {
    zh: {
        "台灣區塊鏈產業地圖nav": "台灣區塊鏈產業地圖",
        "台灣產業消息": "台灣產業消息",
        "產業名人觀點": "產業名人觀點",
        "動區新聞": "動區新聞",
        "申請上架": "申請上架",
        "台灣區塊鏈產業地圖header": "台灣區塊鏈產業地圖",
        "掌握台灣區塊鏈產業 11 大分類、200+ 企業現況": "掌握台灣區塊鏈產業 11 大分類、200+ 企業現況",
        "輸入E-mail 領取產業地圖": "輸入E-mail 領取產業地圖",
        "本地圖由以下單位共同製作：": "本地圖由以下單位共同製作：",
        "台灣區塊鏈產業地圖title": "台灣區塊鏈產業地圖",
        "地圖": "地圖",
        "清單": "清單",
        "下載地圖": "下載地圖",
        "直達": "直達",
        "更新日期：": "更新日期：",
        "台灣產業消息": "台灣產業消息",
        "法規": "法規",
        "區塊鏈商業應用": "區塊鏈商業應用",
        "加密貨幣市場": "加密貨幣市場",
        "人物專訪": "人物專訪",
        "獨立觀點": "獨立觀點",
        "區塊鏈新手教學": "區塊鏈新手教學",
        "產業名人觀點": "產業名人觀點",
        "為您整理一週國內外焦點動態": "為您整理一週國內外焦點動態",
        "動區週報": "動區週報",
        "立即訂閱": "立即訂閱",

        "台灣最具影響力的區塊鏈媒體": "台灣最具影響力的區塊鏈媒體",
        "最即時最全面的區塊鏈產業新聞站": "最即時最全面的區塊鏈產業新聞站",
        "動區動趨": "動區動趨",
        
        "動區社群": "動區社群",
        "幣圈大戶內線情報－動森(動區森林)": "幣圈大戶內線情報－動森(動區森林)",
        "動區大戶情報2群": "動區大戶情報2群",
        "BlockTempo 官方討論群": "BlockTempo 官方討論群",
        "動區 元宇宙 🚀": "動區 元宇宙 🚀",
        "台灣區塊鏈/比特幣/加密貨幣社群": "台灣區塊鏈/比特幣/加密貨幣社群",
        "區塊鏈技術與智能合約研究社群": "區塊鏈技術與智能合約研究社群",

        "精選專題": "精選專題",
        "動區動趨 BLOCKTEMPO 新聞站": "動區動趨 BLOCKTEMPO 新聞站",
        "亞洲區塊鏈高峰會": "亞洲區塊鏈高峰會",
        "動區塊聚 BLOCKMEET": "動區塊聚 BLOCKMEET",
        "動區新手村": "動區新手村",
        "2022 台灣區塊鏈影響力人物": "2022 台灣區塊鏈影響力人物",
        "2021 台灣區塊鏈影響力人物": "2021 台灣區塊鏈影響力人物",
    }
};

if ( !i18nMapping[langCode] ) {
    langCode = "zh";
}

const _t = word => {
    return i18nMapping[langCode][word] || word;
};

const _tApply = html => {
    let res = html;
    for ( const [key, value] of Object.entries( i18nMapping[langCode] ) ) {
        res = res.replaceAll("{%" + key + "%}", value);
    }
    return res;
};
